#### Pandas Basics - Tutorial 01

In [112]:
import numpy as np
import pandas as pd

#### Series

In [113]:
list_1 = ['a','b','c','d']  # python LIST
labels = [1,2,3,4]  # python list

Ser_1 = pd.Series(data = list_1, index = labels)

In [114]:
Ser_1

1    a
2    b
3    c
4    d
dtype: object

#### We can also add a Numpy array to a Pandas Series

In [115]:
arr_1 = np.array([1,2,3,4])
Ser_2 = pd.Series(data = arr_1)

Ser_2

0    1
1    2
2    3
3    4
dtype: int32

#### We can pass Python Dictionaires as well to create a Pandas Series

In [116]:
dict_1 = {
        "f_name":"anand",  # key : value
        "s_name": "Khandekar",
        "age": 53
        }

Ser_3 = pd.Series(dict_1)
Ser_3

f_name        anand
s_name    Khandekar
age              53
dtype: object

We can add two series but they should have the SAME labels

##### Dataframes

These are 2D ones. Can be made form different SERIES

In [117]:
print(np.random.randint(10,15,3))

[13 10 10]

In [121]:
arr_2 = np.random.randint(10, 50, size = (2,3))
arr_2

array([[17, 45, 38],
       [38, 47, 49]])

In [122]:
df_1 = pd.DataFrame(data = arr_2, index = ['row1','row2'], columns = ['phy', 'chem', 'math'])  # data and columns are keywords in pd.DataFrame
df_1  

# PAndas uses the word INDEX in place of a ROW ..

      phy  chem  math
row1   17    45    38
row2   38    47    49

#### Editing and Retrieving DATA

In [123]:
df_1

      phy  chem  math
row1   17    45    38
row2   38    47    49

In [124]:
df_1['math'] # we can retrieve one particular column using its name

row1    38
row2    49
Name: math, dtype: int32

In [125]:
df_1[['phy','math']]  # we can retrieve two columns, just NOTE the two paranthesis

      phy  math
row1   17    38
row2   38    49

In [126]:
# we can acess a ROW as a SERIES using location 
df_1.loc['row1']

phy     17
chem    45
math    38
Name: row1, dtype: int32

In [127]:
df_1.iloc[0]  # we can grab an entore ROW by its index position. first ROW has index ZERO

phy     17
chem    45
math    38
Name: row1, dtype: int32

In [128]:
# how about getting a particular CELL
df_1.loc['row1','math']

38

In [129]:
# we can also acess multiple rows and columns
df_1.loc[['row1','row2'],['math','chem']]  # NOTE the order of math and chem does not matter

      math  chem
row1    38    45
row2    49    47

In [130]:
df_1

      phy  chem  math
row1   17    45    38
row2   38    47    49

In [131]:
# we can create a NEW column as well
df_1['Total'] = df_1['phy'] + df_1['chem'] + df_1['math']
df_1

      phy  chem  math  Total
row1   17    45    38    100
row2   38    47    49    134

In [132]:
df_1   # BE very careful since we have now modified the original DataFrame df_1

      phy  chem  math  Total
row1   17    45    38    100
row2   38    47    49    134

#### We can DELETE a COLUMN using the keyword 'drop'

In [134]:
df_1.drop('Total', axis = 1, inplace = True)
df_1

      phy  chem  math
row1   17    45    38
row2   38    47    49

#### Lets ADD a new ROW 

* create a python dictionary first
* convert it into pandas Series 
* use 'df.append' to add a new ROW as a SERIES

In [136]:
dict_1 = {'phy': 11 , 'chem':22, 'math':33}  # python dictionary
dict_1   # python dictionary

{'phy': 11, 'chem': 22, 'math': 33}

In [137]:
new_row = pd.Series(dict_1, name ='row3')
new_row

phy     11
chem    22
math    33
Name: row3, dtype: int64

In [138]:
df_1 = df_1.append(new_row)

In [139]:
df_1

      phy  chem  math
row1   17    45    38
row2   38    47    49
row3   11    22    33

#### Now we will learn how to DELETE a ROW

In [140]:
df_1.drop('row2', axis = 0, inplace = True)
df_1

      phy  chem  math
row1   17    45    38
row3   11    22    33

#### Conditional Selection of DATA

In [ ]:
arr_2 = np.random.randint(10,50, size = (2,3))

df1 = pd.DataFrame(arr_2,['A','B'],['C','D','E'])
df1

In [ ]:
# conditional formatting
# gt lt eq nq  can also be used instead of actual symbols
df1.gt(40)  # same as df1 > 40

#### let's say we want to return a ROW if the cell value matches a condition

In [ ]:
df1[df1['C'] > 11 ]  # we can stack the data frames

#### File Input/Output
Pandas can work with the following types of data : CSV, Plain Text, JSON, XML, PDF, SQL, HTML, XLSX, DOCX, ZIP, Images Hierarchical Data Format, MP3, and MP4.

In [ ]:
!pip install pymysql

In [ ]:
import pymysql

In [ ]:
cs_df = pd.read_csv('ComputerSales.csv')
cs_df

#### We can also do it the other way around
* i.e. we can store an exisiting dataframe into a csv file to be used outside Python as follows

In [ ]:
cs_df.to_csv('ComputerSalesBU01.csv')  #Back Up 01 file in csv format stored in this folder

* once this cell above is finished executing, check for the file newly created "ComputerSalesBU01.csv" in this folder

#### We now use Pndas to read an EXCEL file

In [ ]:
pd.read_excel('Financial Sample.xlsx', 0)

* like before, we can save the 'cs_df' created up as an EXCEL file using Pandas as follows/

In [ ]:
cs_df.to_excel('ComputerSalesBU02.xlsx') # once this cell runs, check for the newly created excel sheet in the folder

In [ ]:
# now read from this newly created EXCEL file
pd.read_excel('ComputerSalesBU02.xlsx')

#### Acessing GOOGLE Spreadsheet DATA in JupyterLAb using Pandas

* https://docs.google.com/spreadsheets/d/1rB2nK0lxkls7r6oWNPgEjQXW-vlWJlcfKQREbw0eSC4/edit?usp=sharing

In [ ]:
sheet_id = '1rB2nK0lxkls7r6oWNPgEjQXW-vlWJlcfKQREbw0eSC4'
xls = pd.ExcelFile(f"https://docs.google.com/spreadsheets/d/{sheet_id}/export?format=xlsx")


year_2019 = pd.read_excel(xls, '2019', header =1)
year_2019